// Autocheck
console.log(`Само-проверка 100/100:
✔️ Создана страница *main* **+60**.
✔️ Создана страница *our pets* **+40**.

❌ 1. Нет блока **Header**: **-10**.
❌ - Нет логотипа: **-2**. Логотип есть, но не работает как ссылка на страницу *main*: **-1**.
❌ - Нет панели навигации: **-5**. Панель навигации есть, но не интерактивная: **-1**. Рекомендуется использовать \`<nav>\`.
❌ - Элемент \`About the shelter\` не работает как ссылка на страницу *main*: **-1**.
❌ - Элемент \`Our pets\` не подсвечен: **-1**.
❌ - Элемент \`Help the shelter\` не работает как якорная ссылка на блок *Help* страницы *main*: **-1**.
❌ - Элемент \`Contacts\` не работает как якорная ссылка на блок *Footer*: **-1**.
❌ - На странице нет элемента \`<h1>\`: **-2**. Элемент есть, но в количестве больше одного: **-1**.
❌ - Фон сильно отличается от того, что на макете: **-1**.
  
❌ 2. Нет блока **Our Friends**: **-20**.
❌ - Нет кнопок пагинации: **-10**. Кнопка есть, но:
  ❌ - Кнопки одного цвета или фона: **-2**.
  ❌ - Кнопки расположены в неверной последовательности: **-2**. 
  ❌ - Кнопки "влево" интерактивные: **-1**.
  ❌ - Кнопки "вправо" не интерактивные: **-1**.
  ❌ - На кружочке страницы нет цифры, или там не единица: **-1**.
  ❌ - Кружочек страницы интерактивный: **-1**.
❌ - Нет карточек с питомцами: **-10**. Карточки есть, но при этом:
  ❌ - Сеточная структура элементов нарушена: **-2**.
  ❌ - Количество карточек не соотвествует макету: **-2**.
  ❌ - Струтура карточек нарушена (например текст или кнопка сверху над картинкой): **-2**.
  ❌ - Карточки не интерактивные: **-2**.
  ❌ - Кнопки \`Learn more\` не меняют цвет при наведении на карточку: **-2**.
  
❌ 3. Нет блока **Footer**: **-10**.
❌ - Сеточная структура элементов нарушена: **-2**.
❌ - Элемент \`email\` не работает как ссылка на почтовый сервис: **-2**.
❌ - Элемент \`телефон\` не работает как ссылка на сервис звонков: **-2**.
❌ - Хотя бы один элемент \`локация\` не работает как ссылка на google maps: **-1**.
❌ - Нет картинки собаки: **-2**. Картинка собаки есть, но сильно смещена, или накладывается на текст или другие блоки: **-1**.
❌ - Фон сильно отличается от того, что на макете (не имеется ввиду смещенная картинка или градиент): **-1**.
`);
